# Описание

- Employee_ID	- Unique identifier for each employee

- Name - Full name (gender-aware generation)

- Gender - Male or Female

- Age - Age of the employee (based on education level and job title)

- Education_Level - One of: High School, Bachelor, Master, PhD

- Experience_Years - Number of years of professional experience

- Department - Business unit, e.g., HR, Engineering, Marketing, etc.

- Job_Title - Role of the employee, e.g., Analyst, Engineer, Manager, etc.

- Location - Work location (e.g., New York, San Francisco, etc.)

- Salary - Annual salary in USD (target for regression)

In [57]:
import pandas as pd
import numpy as np
from sklearn.model_selection import cross_val_score, train_test_split
from sklearn.metrics import r2_score
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LinearRegression

import pickle

RANDOM_STATE = 42

In [2]:
df = pd.read_csv('Employers_data.csv')

In [4]:
df.head()

   Employee_ID            Name  Age  ... Education_Level  Location  Salary
0            1    Merle Ingram   24  ...          Master    Austin   90000
1            2      John Mayes   56  ...          Master   Seattle  195000
2            3    Carlos Wille   21  ...        Bachelor  New York   35000
3            4  Michael Bryant   30  ...        Bachelor  New York   75000
4            5   Paula Douglas   25  ...          Master   Seattle   70000

[5 rows x 10 columns]

In [5]:
df.drop(columns=['Employee_ID', 'Name'], inplace=True)

In [27]:
df['Gender'] = df['Gender'].map({'Male': 1, 'Female': 0})

In [ ]:
X = df.drop(columns='Salary')
y = df['Salary']

In [72]:
pipeline = Pipeline([
    ('encoder', OneHotEncoder(drop='first')),
    ('scaler', StandardScaler(with_mean=False)),
    ('model', LinearRegression())
])

In [73]:
cross_val_score(pipeline, X, y, cv=5, scoring='r2').mean()

np.float64(0.9913490525946764)

In [74]:
pipeline.fit(X, y)

with open('pipeline.pkl', 'wb') as f:
    pickle.dump(pipeline, f)